app/controllers/home_controller.rb

  def login
        logger.debug "login starts here:"
        email = params["email"]
    	psswd = params["password"]
        #fetch user interface by composite key find method
        @user = User.find(:first, :conditions=>["email=? AND password=?", email, psswd])
---
SELECT `users`.* FROM `users` WHERE (email=NULL AND password=NULL) LIMIT 1